In [53]:
import pandas as pd

from pandas import Series, DataFrame

import numpy as np

In [54]:
object1 = Series([4, 5, -3, 6])
object1

0    4
1    5
2   -3
3    6
dtype: int64

In [55]:
object2 = Series([4, 5, -3, 6], index=['d','a','c','b'])
object2

d    4
a    5
c   -3
b    6
dtype: int64

In [56]:
object2[['a','b']]

a    5
b    6
dtype: int64

In [57]:
object2[object2 > 0]

d    4
a    5
b    6
dtype: int64

In [58]:
data = {'state':['oh', 'oh', 'oh', 'Nev', 'Nev'],
       'year':[2000,2001,2002,2001,2002],
       'population':[1.5, 1.7, 2.3, 2.9, 3.2]}
data

{'state': ['oh', 'oh', 'oh', 'Nev', 'Nev'],
 'year': [2000, 2001, 2002, 2001, 2002],
 'population': [1.5, 1.7, 2.3, 2.9, 3.2]}

In [59]:
frame = DataFrame(data)
frame

   population state  year
0         1.5    oh  2000
1         1.7    oh  2001
2         2.3    oh  2002
3         2.9   Nev  2001
4         3.2   Nev  2002

In [60]:
DataFrame(data, columns=['year', 'state', 'population'])

   year state  population
0  2000    oh         1.5
1  2001    oh         1.7
2  2002    oh         2.3
3  2001   Nev         2.9
4  2002   Nev         3.2

In [61]:
frame2 = DataFrame(data, columns=['year', 'state', 'population', 'debt'], 
                   index=['one', 'two', 'three', 'four', 'five'])
frame2

       year state  population debt
one    2000    oh         1.5  NaN
two    2001    oh         1.7  NaN
three  2002    oh         2.3  NaN
four   2001   Nev         2.9  NaN
five   2002   Nev         3.2  NaN

In [62]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [63]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [64]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  1.101805 -1.282572 -0.582852 -2.407580
2013-01-02  1.077791 -0.362511 -0.739467 -0.908871
2013-01-03  2.145247 -1.136311 -0.998034 -0.785390
2013-01-04  1.547177 -1.781535  0.837906  0.272400
2013-01-05 -0.247812 -0.958923  0.766751 -0.411591
2013-01-06 -0.106742  0.159412  1.539008  0.307386

In [65]:
df2 = pd.DataFrame({'A':1,
                  'B':pd.Timestamp('20130102'),
                  'C':pd.Series(1, index=list(range(4)),dtype='float32'),
                  'D':np.array([3] * 4, dtype='int32'),
                  'E':pd.Categorical(['test', 'train', 'test', 'train']),
                  'F':'foo'})
df2

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

In [66]:
df2.A

0    1
1    1
2    1
3    1
Name: A, dtype: int64

In [67]:
df2.head()

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

In [68]:
df2.tail(3)

   A          B    C  D      E    F
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

In [69]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.919578 -0.893740  0.137219 -0.655607
std    0.934935  0.691924  1.041937  0.999849
min   -0.247812 -1.781535 -0.998034 -2.407580
25%    0.189391 -1.246007 -0.700313 -0.878001
50%    1.089798 -1.047617  0.091950 -0.598490
75%    1.435834 -0.511614  0.820117  0.101403
max    2.145247  0.159412  1.539008  0.307386

In [70]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.101805    1.077791    2.145247    1.547177   -0.247812   -0.106742
B   -1.282572   -0.362511   -1.136311   -1.781535   -0.958923    0.159412
C   -0.582852   -0.739467   -0.998034    0.837906    0.766751    1.539008
D   -2.407580   -0.908871   -0.785390    0.272400   -0.411591    0.307386

In [71]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -2.407580 -0.582852 -1.282572  1.101805
2013-01-02 -0.908871 -0.739467 -0.362511  1.077791
2013-01-03 -0.785390 -0.998034 -1.136311  2.145247
2013-01-04  0.272400  0.837906 -1.781535  1.547177
2013-01-05 -0.411591  0.766751 -0.958923 -0.247812
2013-01-06  0.307386  1.539008  0.159412 -0.106742

In [72]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-04  1.547177 -1.781535  0.837906  0.272400
2013-01-01  1.101805 -1.282572 -0.582852 -2.407580
2013-01-03  2.145247 -1.136311 -0.998034 -0.785390
2013-01-05 -0.247812 -0.958923  0.766751 -0.411591
2013-01-02  1.077791 -0.362511 -0.739467 -0.908871
2013-01-06 -0.106742  0.159412  1.539008  0.307386

In [73]:
dates = pd.date_range('1/1/2000', periods=8)
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')

In [85]:
df = pd.DataFrame(np.random.randn(8,4), index=dates, columns=['A', 'B', 'C', 'D'])

In [86]:
df

                   A         B         C         D
2000-01-01  0.772535  1.518500  0.742373  1.116107
2000-01-02 -0.750904 -0.770951  0.732477  0.200661
2000-01-03  1.560614 -2.165905  0.477658  2.067794
2000-01-04 -0.441770 -0.962696 -0.379191 -1.070905
2000-01-05 -0.327067  0.486044 -0.465961  0.491720
2000-01-06 -0.650378  0.851263  0.132063  1.046057
2000-01-07  1.313911 -0.117303 -0.662128 -1.167560
2000-01-08 -0.112248  0.201193 -2.101295 -1.105932

In [76]:
s = df['A']

In [77]:
s[dates[5]]

1.644944428741711

In [78]:
x = pd.DataFrame({'x':[1,2,3],'y':[3,4,5]})

In [79]:
x

   x  y
0  1  3
1  2  4
2  3  5

In [80]:
x.iloc[1]

x    2
y    4
Name: 1, dtype: int64

In [81]:
x.iloc[1] = dict(x=9, y=99)

In [82]:
x

   x   y
0  1   3
1  9  99
2  3   5

In [88]:
df2 = df.copy()

In [91]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+['E'])

In [92]:
df1.loc[dates[0]:dates[1], 'E'] = 1

In [93]:
df1

                   A         B         C         D    E
2000-01-01  0.772535  1.518500  0.742373  1.116107  1.0
2000-01-02 -0.750904 -0.770951  0.732477  0.200661  1.0
2000-01-03  1.560614 -2.165905  0.477658  2.067794  NaN
2000-01-04 -0.441770 -0.962696 -0.379191 -1.070905  NaN

In [94]:
df1.dropna(how='any')

                   A         B         C         D    E
2000-01-01  0.772535  1.518500  0.742373  1.116107  1.0
2000-01-02 -0.750904 -0.770951  0.732477  0.200661  1.0

In [95]:
df1.fillna(value=5)

                   A         B         C         D    E
2000-01-01  0.772535  1.518500  0.742373  1.116107  1.0
2000-01-02 -0.750904 -0.770951  0.732477  0.200661  1.0
2000-01-03  1.560614 -2.165905  0.477658  2.067794  5.0
2000-01-04 -0.441770 -0.962696 -0.379191 -1.070905  5.0

In [96]:
pd.isnull(df1)

                A      B      C      D      E
2000-01-01  False  False  False  False  False
2000-01-02  False  False  False  False  False
2000-01-03  False  False  False  False   True
2000-01-04  False  False  False  False   True

In [99]:
df.mean()

A    0.170587
B   -0.119982
C   -0.190501
D    0.197243
dtype: float64

In [100]:
df.apply(np.cumsum)

                   A         B         C         D
2000-01-01  0.772535  1.518500  0.742373  1.116107
2000-01-02  0.021631  0.747549  1.474850  1.316767
2000-01-03  1.582245 -1.418356  1.952508  3.384561
2000-01-04  1.140475 -2.381052  1.573317  2.313657
2000-01-05  0.813407 -1.895008  1.107356  2.805376
2000-01-06  0.163029 -1.043745  1.239419  3.851433
2000-01-07  1.476940 -1.161048  0.577290  2.683873
2000-01-08  1.364692 -0.959855 -1.524005  1.577942

In [101]:
df.apply(lambda x: x.max() - x.min())

A    2.311518
B    3.684405
C    2.843668
D    3.235354
dtype: float64

In [102]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    0
1    4
2    6
3    2
4    4
5    1
6    0
7    0
8    2
9    4
dtype: int32

In [103]:
s.value_counts()

4    3
0    3
2    2
6    1
1    1
dtype: int64

In [104]:
df = pd.DataFrame(np.random.randn(10, 4))

In [105]:
df

          0         1         2         3
0  0.368181 -1.709406 -0.769386  0.548466
1 -0.156467 -0.194336  0.702704  1.322020
2  1.397550 -0.832742 -1.118751  0.694483
3 -1.224082 -1.263877 -0.510775  0.921068
4 -1.554451 -1.673230 -1.339590 -0.077285
5  0.730041 -0.961142 -0.176995  0.307640
6 -0.699625 -0.709340  0.276104  1.598527
7 -0.603712 -0.310904 -0.315916 -0.815692
8 -0.680539  1.634707 -0.160417 -0.288935
9 -0.161576  0.345363  0.658163  0.079369

In [106]:
pieces = [df[:3], df[3:7], df[7:]]

In [107]:
pieces

[          0         1         2         3
 0  0.368181 -1.709406 -0.769386  0.548466
 1 -0.156467 -0.194336  0.702704  1.322020
 2  1.397550 -0.832742 -1.118751  0.694483,
           0         1         2         3
 3 -1.224082 -1.263877 -0.510775  0.921068
 4 -1.554451 -1.673230 -1.339590 -0.077285
 5  0.730041 -0.961142 -0.176995  0.307640
 6 -0.699625 -0.709340  0.276104  1.598527,
           0         1         2         3
 7 -0.603712 -0.310904 -0.315916 -0.815692
 8 -0.680539  1.634707 -0.160417 -0.288935
 9 -0.161576  0.345363  0.658163  0.079369]

In [108]:
pd.concat(pieces)

          0         1         2         3
0  0.368181 -1.709406 -0.769386  0.548466
1 -0.156467 -0.194336  0.702704  1.322020
2  1.397550 -0.832742 -1.118751  0.694483
3 -1.224082 -1.263877 -0.510775  0.921068
4 -1.554451 -1.673230 -1.339590 -0.077285
5  0.730041 -0.961142 -0.176995  0.307640
6 -0.699625 -0.709340  0.276104  1.598527
7 -0.603712 -0.310904 -0.315916 -0.815692
8 -0.680539  1.634707 -0.160417 -0.288935
9 -0.161576  0.345363  0.658163  0.079369

In [109]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval':[1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [111]:
left

   key  lval
0  foo     1
1  foo     2

In [112]:
right

   key  rval
0  foo     4
1  foo     5

In [113]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [114]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval':[1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

In [115]:
left

   key  lval
0  foo     1
1  bar     2

In [116]:
right

   key  rval
0  foo     4
1  bar     5

In [117]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [118]:
df = pd.DataFrame({'A': ['foo','bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
                  'B': ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
                  'C': np.random.randn(8),
                  'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.726036 -1.660666
1  bar    one  0.186498  0.539435
2  foo    two -0.293696  0.331806
3  bar  three -0.503165 -2.188225
4  foo    two  0.644460 -0.095197
5  bar    two -0.742383 -0.759493
6  foo    one  0.930619 -0.708556
7  foo  three -2.046165  1.558471

In [119]:
df.groupby('A').sum()

            C         D
A
bar -1.059049 -2.408282
foo -0.038746 -0.574143

In [120]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one    0.186498  0.539435
    three -0.503165 -2.188225
    two   -0.742383 -0.759493
foo one    1.656655 -2.369222
    three -2.046165  1.558471
    two    0.350764  0.236609

In [125]:
df.to_csv('foo.csv')

In [126]:
pd.read_csv('foo.csv')

   Unnamed: 0    A      B         C         D
0           0  foo    one  0.726036 -1.660666
1           1  bar    one  0.186498  0.539435
2           2  foo    two -0.293696  0.331806
3           3  bar  three -0.503165 -2.188225
4           4  foo    two  0.644460 -0.095197
5           5  bar    two -0.742383 -0.759493
6           6  foo    one  0.930619 -0.708556
7           7  foo  three -2.046165  1.558471

In [128]:
df.to_excel('foo.xlsx', sheet_name='Sheet1')